The only change during upgrade is the group block and results in an update in-place.

This is expected and the exact details vary by the existing deployment.

existing deployment with less then 4G memory: The group memory block will update in-place to 4G of memory.
existing deployment with 4G plus memory: No change.
existing deployment adding host_flavor (as below): The group memory block will update in-place to the flavor chosen.

The upgrade test is safe to skip.

```hcl
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   ~ update in-place
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:  <= read (data resources)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: Terraform will perform the following actions:
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   # module.icd_redis.data.ibm_database_connection.database_connection will be read during apply
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   # (depends on a resource or a module with changes pending)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:  <= data "ibm_database_connection" "database_connection" {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + amqps         = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + analytics     = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + bi_connector  = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + cli           = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + deployment_id = "crn:v1:bluemix:public:databases-for-redis:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:c97a9958-575b-4bb1-a547-7d8448141142::"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + emp           = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + endpoint_type = "private"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + grpc          = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + https         = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + id            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + mongodb       = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + mqtts         = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + mysql         = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + ops_manager   = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + postgres      = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + rediss        = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + secure        = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + stomp_ssl     = (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + user_id       = "admin"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + user_type     = "database"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:     }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   # module.icd_redis.ibm_database.redis_database will be updated in-place
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   ~ resource "ibm_database" "redis_database" {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         id                        = "crn:v1:bluemix:public:databases-for-redis:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:c97a9958-575b-4bb1-a547-7d8448141142::"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         name                      = "redis-advanced-upg-jmfyqc-redis"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         tags                      = []
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         # (20 unchanged attributes hidden)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       - group {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           - group_id = "member" -> null
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           - cpu {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               - allocation_count = 0 -> null
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           - disk {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               - allocation_mb = 1024 -> null
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           - members {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               - allocation_count = 2 -> null
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           - memory {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               - allocation_mb = 1024 -> null
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:       + group {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           + group_id = "member"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           + cpu {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               + allocation_count = 0
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           + disk {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               + allocation_mb = 1024
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           + host_flavor {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               + id = "multitenant"
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           + members {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               + allocation_count = 2
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:           + memory {
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:               + allocation_mb = 4096
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:             }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:         # (3 unchanged blocks hidden)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:     }
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: Plan: 0 to add, 1 to change, 0 to destroy.
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: Changes to Outputs:
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   ~ hostname                   = "c97a9958-575b-4bb1-a547-7d8448141142.bpb68u2f0gvaqgd0n64g.private.databases.appdomain.cloud" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185:   ~ port                       = 30348 -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-06-28T12:50:32Z command.go:185: ╷
```